app/Http/Controllers/Frontend/HomeController.php

    public function home(){

        $products= product::all();
        // Fetch the latest 5 products
      $latestProducts = Product::orderBy('created_at', 'desc')->take(5)->get();
      $banners = Banner::all(); // Assuming you have a Banner model
---
select * from `products` order by `created_at` desc limit 5
select * from `banners`

    public function showProducts()
{
    $categories = Category::all(); // Fetch all categories
    $products = Product::with('category')->get(); // Fetch products with their categories
---
select * from `products`