app/Http/Controllers/BlogController.php

select * from `blogposts`
---
    public function index(){

        $blogpost= Blogpost::all();

insert into `blogposts` (`title`, `slug`, `content`, `updated_at`, `created_at`) values ('Google', 'google', 'goggle', '2024-11-21 09:32:00', '2024-11-21 09:32:00')
---
    public function Storeblog(Request $request){
        //dd($request->all());
        $request->validate([
            'title'=> 'required',
            'slug'=> 'required',
            'content'=> 'required'

        ]);

        $blogpost = Blogpost::create([
            'title' => $request -> title,
            'slug' => $request -> slug ,
            'content' => $request -> content

        ]);