app/Http/Controllers/HomeController.php

    public function home(){

        $Productlist=Product::count();
        $Orderlist=Order::count();
---
select count(*) as aggregate from `products`
select count(*) as aggregate from `orders`